In [2]:
import pyodbc 
import pandas as pd

conn = pyodbc.connect('Driver={SQL Server};'
                      'Server=.;'
                      'Database=Chinook;'
                      'Trusted_Connection=yes;')


sql = 'select   C.LastName,C.FirstName,T.Name,A.Title from [dbo].[InvoiceLine] IL inner join [dbo].[Invoice] I on IL.InvoiceId=I.InvoiceId inner join [dbo].[Track] T on IL.TrackId=T.TrackID inner join [dbo].[Customer] C on C.CustomerId=I.CustomerId inner join [dbo].[Album] A on A.AlbumId=T.AlbumId order by c.LastName,C.FirstName'


data = pd.read_sql(sql,conn)


data.head()

  LastName FirstName              Name           Title
0  Almeida   Roberto        Vai Passar  Minha Historia
1  Almeida   Roberto  Morena De Angola  Minha Historia
2  Almeida   Roberto    Meu Caro Amigo  Minha Historia
3  Almeida   Roberto      Mateus Enter  Afrociberdelia
4  Almeida   Roberto     Samba Do Lado  Afrociberdelia